In [1]:
from adder import add
value = add(2,2)
print(value)

4

In [1]:
import sqlite3

In [3]:
with sqlite3.connect("test.db") as connection:
    cursor = connection.cursor()
    query = "SELECT datetime('now', 'localtime');"
    time = cursor.execute(query).fetchone()[0]

In [4]:
time

'2023-01-02 19:32:14'

In [5]:
with sqlite3.connect("test.db") as connection:
    cursor = connection.cursor()
    cursor.execute("""
        CREATE TABLE People(FirstName TEXT, LastName TEXT, Age INT);
    """)
    cursor.execute("""
        INSERT INTO People  (FirstName, LastName , Age) VALUES('RON','OBVIOUS','42');
    """)

In [6]:
people_values = (
    ('Luigi', 'Vercotti', 43),
    ('Yadira', 'Shany', 4),
    ('Justice','Chyna',32),
    ('Legros','Gerry',44)
)

In [7]:
cursor.executemany("INSERT INTO People VALUES(?,?,?)", people_values)

In [9]:
cursor.executescript("""
    INSERT INTO People VALUES('Shana','Feil',23),
    ('Thiel','Kilback', 23),
    ('London','Fritsch', 45),
    ('Kiana','Mitchel', 33);
""")

In [8]:
import sqlite3

# Get person data from user
first_name = input("Enter your first name:")
last_name = input("Enter your last name:")
age = int(input("Enter your age:"))
data = (first_name,last_name,age)

# Execute insert statement for supplied person data
with sqlite3.connect("test.db") as connection:
    cursor = connection.cursor()
    cursor.execute(
        f"INSERT INTO people Values (?,?,?)",data
        );

In [10]:
cursor.execute(
    "UPDATE People SET Age=? WHERE FirstName=? AND LastName=?;",
    (45,'Luigi','Vercotti')
)

In [11]:
cursor.execute(
    "SELECT FirstName, LastName from People where Age = 45;"
)

for row in cursor.fetchall():
    print(row)

('Luigi', 'Vercotti')
('London', 'Fritsch')

In [23]:
import sqlite3



with sqlite3.connect('schedule.db') as connection:
    cursor = connection.cursor()
    cursor.execute(
        """CREATE TABLE Roster
        (
            Name TEXT,
            Species TEXT,
            IQ INT
        );
            """
    )
    data = (
    ("Jean-Baptiste Zorg", "Human", 122),
    ("Korben Dallas", "Meat Popsicle", 100),
    ("Ak'not", "Mangalore", -5)
    )

    cursor.executemany("INSERT INTO Roster VALUES(?,?,?)", data)

In [25]:
cursor.execute(
    """
    UPDATE Roster SET Species = 'Human' where Name = 'Korben Dallas';
    """
)

In [26]:
results = cursor.execute(
    """
    SELECT Name, IQ FROM Roster where Species = 'Human';
    """
)

for row in results:
    print(row)

('Jean-Baptiste Zorg', 122)
('Korben Dallas', 100)

In [7]:
import sqlite3

with sqlite3.connect('population.db') as pop:
    cursor = pop.cursor()
    cursor.executescript(
        """
        DROP TABLE IF EXISTS population;
        CREATE TABLE population(
            Region TEXT,
            Population INT
        );
        INSERT INTO population values
        ('Central Africa', 330993),
        ('Southeastern Africa', 743112),
        ('Northtern Africa', 1037463),
        ('Southern Africa', 743112),
        ('Asia Pacific', 785468),
        ('Middle East' , 687630),
        ('Eastern Asia', 1362955),
        ('South America', 593121),
        ('Eastern Europe', 223427),
        ('North America', 661157),
        ('Western Europe', 387933),
        ('Japan', 100562);
        """
    )

In [21]:
rows = cursor.execute("""
    SELECT * from population;
""")

for row in  rows:
    print(row)

('Central Africa', 330993)
('Southeastern Africa', 743112)
('Northtern Africa', 1037463)
('Southern Africa', 743112)
('Asia Pacific', 785468)
('Middle East', 687630)
('Eastern Asia', 1362955)
('South America', 593121)
('Eastern Europe', 223427)
('North America', 661157)
('Western Europe', 387933)
('Japan', 100562)

In [19]:
cursor.fetchall()

[('Central Africa', 330993),
 ('Southeastern Africa', 743112),
 ('Northtern Africa', 1037463),
 ('Southern Africa', 743112),
 ('Asia Pacific', 785468),
 ('Middle East', 687630),
 ('Eastern Asia', 1362955),
 ('South America', 593121),
 ('Eastern Europe', 223427),
 ('North America', 661157),
 ('Western Europe', 387933),
 ('Japan', 100562)]

In [22]:
cursor.execute('Select Region, Population from population ORDER by REGION')

In [23]:
cursor.fetchall()

[('Asia Pacific', 785468),
 ('Central Africa', 330993),
 ('Eastern Asia', 1362955),
 ('Eastern Europe', 223427),
 ('Japan', 100562),
 ('Middle East', 687630),
 ('North America', 661157),
 ('Northtern Africa', 1037463),
 ('South America', 593121),
 ('Southeastern Africa', 743112),
 ('Southern Africa', 743112),
 ('Western Europe', 387933)]

In [24]:
cursor.execute("""
    SELECT Region, Population from population ORDER BY Population DESC
""")

In [25]:
cursor.fetchall()

[('Eastern Asia', 1362955),
 ('Northtern Africa', 1037463),
 ('Asia Pacific', 785468),
 ('Southeastern Africa', 743112),
 ('Southern Africa', 743112),
 ('Middle East', 687630),
 ('North America', 661157),
 ('South America', 593121),
 ('Western Europe', 387933),
 ('Central Africa', 330993),
 ('Eastern Europe', 223427),
 ('Japan', 100562)]

In [28]:
cursor.execute('SELECT Region from population where Population > 1000000')

In [29]:
cursor.fetchall()

[('Northtern Africa',), ('Eastern Asia',)]

In [30]:
cursor.execute('UPDATE population SET Population = 100600 where Region = "Japan"')

In [62]:
import sqlite3

with sqlite3.connect("Appointment.db") as appointment:
    cursor = appointment.cursor()
    cursor.executescript(
        """
            DROP TABLE IF EXISTS appointment;
            DROP TABLE IF EXISTS hospital;
            DROP TABLE IF EXISTS patient;
            DROP TABLE IF EXISTS doctor;

            CREATE TABLE patient(
                id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
                name TEXT,
                birthday TEXT    
            );
            CREATE TABLE hospital(
                id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
                name TEXT,
                address TEXT
            );
            CREATE TABLE doctor(
                id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
                name TEXT,
                hospital_id,
                foreign key(hospital_id) references hospital(id)
            );
            CREATE TABLE appointment(
                id INTEGER  NOT NULL PRIMARY KEY AUTOINCREMENT,
                patient_id INTEGER,
                doctor_id INTEGER,
                date TEXT,
                foreign key(patient_id) references patient(id),
                foreign key(doctor_id) references doctor(id)
            );
    INSERT INTO patient(name,birthday) values('Alice','1978/04/02'),('Zack','1964/12/15');


    INSERT INTO doctor (name, hospital_id) values ('Rajani',1),('Nianiaris',1),('Newton',2),('Vaz',2);



    INSERT into hospital (name, address) values ('Central','52 Walnut St.'),('East','8 Elm St.');


    INSERT into appointment(patient_id, doctor_id,date) values (1,1,'2008/09/01'),
    (1,2,'2008/10/04'),
    (1,3,'2008/09/14'),
    (2,3,'2008/09/18'),
    (2,4,'2008/11/01');
        """
    )

In [74]:
cursor.execute("""
    SELECT name, birthday, date from patient INNER JOIN appointment on patient.id = patient_id;
""")

In [75]:
cursor.fetchall()

[('Alice', '1978/04/02', '2008/09/01'),
 ('Alice', '1978/04/02', '2008/10/04'),
 ('Alice', '1978/04/02', '2008/09/14'),
 ('Zack', '1964/12/15', '2008/09/18'),
 ('Zack', '1964/12/15', '2008/11/01')]

In [77]:
cursor.execute("""
SELECT doctor.name, hospital.name, address from doctor inner join hospital on hospital_id = hospital.id;
""")

In [78]:
cursor.fetchall()

[('Rajani', 'Central', '52 Walnut St.'),
 ('Nianiaris', 'Central', '52 Walnut St.'),
 ('Newton', 'East', '8 Elm St.'),
 ('Vaz', 'East', '8 Elm St.')]

In [67]:
cursor.fetchall()

[(1, 'Alice', '1978/04/02'), (2, 'Zack', '1964/12/15')]

In [68]:
cursor.execute("""
SELECT  * from doctor;
""")

In [69]:
cursor.fetchall()

[(1, 'Rajani', 1), (2, 'Nianiaris', 1), (3, 'Newton', 2), (4, 'Vaz', 2)]

In [85]:
cursor.execute("""
    select patient.name, patient.birthday, doctor.name,appointment.date,hospital.name, hospital.address from patient
    inner join 
    appointment 
    on patient.id = patient_id
    inner join 
    doctor
    on doctor.id = doctor_id
    inner join
    hospital
    on hospital.id = hospital_id
""")

In [86]:
cursor.fetchall()

[('Alice', '1978/04/02', 'Rajani', '2008/09/01', 'Central', '52 Walnut St.'),
 ('Alice',
  '1978/04/02',
  'Nianiaris',
  '2008/10/04',
  'Central',
  '52 Walnut St.'),
 ('Alice', '1978/04/02', 'Newton', '2008/09/14', 'East', '8 Elm St.'),
 ('Zack', '1964/12/15', 'Newton', '2008/09/18', 'East', '8 Elm St.'),
 ('Zack', '1964/12/15', 'Vaz', '2008/11/01', 'East', '8 Elm St.')]